#                          3.集合
#用{}包裹，打印无序且去除跳过重复部分
a = {'123',"123","我爱你","我恨你"}#单双引号可自由替换
print(a)
# 因为无序,所以没有索引
s=set()
#不可直接写成{},{}为空字典,不是空集合
a.add('t')
#末尾添加
a.remove('t')
#移除指定元素,移除一个
a.pop()
#随意移除一个
a.clear()
#清空集合
a.difference(s)
a-s
#求取在前面不在后面集合的元素,差集
a.union(s)
a|s
#求取并集
a.intersection(s)
a&s
#求取交集,两种方法都行
#打印整体不会打印括号

#                           4.字典
# 写法和jso'n的对象类似,键对值取值
dict = {'姓名':'whb',
      '年龄':18,
      18:18}#单双引号可自由替换
print(dict['姓名'])
print(dict["年龄"])
print(dict[18])
dict[18]=19# 字典值可修改,键不可修改
a1={}#定义空字典

# 添加
dict["爱好"]="篮球"
# 未存在键值对添加直接添加就行

# 删除
del dict['爱好']
# 删除对应键值对
socre=dict['爱好']
# 删除对应键值对并返回值

# 查询
dict.get("姓名")
# 获得对应的值
dict.keys()
# 获得所有key
dict.values()
# 获得所有值
dict.items()
# 获得所有键值对
